tap "adoptopenjdk/openjdk"
tap "argoproj/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "sanemat/font"
brew "anyenv"
brew "libpng"
brew "autoconf"
brew "aws-elasticbeanstalk"
brew "awscli"
brew "bat"
brew "bison@2.7"
brew "bzip2"
brew "pcre2"
brew "glib"
brew "pkg-config"
brew "openssl@1.1"
brew "python@3.9"
brew "emacs"
brew "cask"
brew "icu4c"
brew "krb5"
brew "libzip"
brew "oniguruma"
brew "tidy-html5"
brew "composer"
brew "direnv"
brew "docker", link: false
brew "docker-machine"
brew "eksctl"
brew "exa"
brew "fd"
brew "harfbuzz"
brew "pango"
brew "gcc"
brew "google-java-format"
brew "jpeg", link: true
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "helm"
brew "jq"
brew "libedit"
brew "libiconv"
brew "libxml2"
brew "libxslt"
brew "mas"
brew "nghttp2"
brew "node"
brew "openjdk@17"
brew "pastel"
brew "peco"
brew "python@3.10"
brew "re2c"
brew "tig"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "argoproj/tap/kubectl-argo-rollouts"
cask "alfred"
cask "amazon-chime"
cask "amazon-workspaces"
cask "clipy"
cask "dbeaver-community"
cask "deepl"
cask "devtoys"
cask "discord"
cask "docker"
cask "evernote"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-source-han-code-jp"
cask "gather"
cask "google-chat"
cask "google-chrome"
cask "google-japanese-ime"
cask "gyazo"
cask "iterm2"
cask "kindle"
cask "microsoft-edge"
cask "ngrok"
cask "obsidian"
cask "postman"
cask "shureplus-motiv"
cask "slack"
cask "spectacle"
cask "spotify"
cask "tableplus"
cask "tunnelblick"
cask "typora"
cask "wireshark"
cask "xmind"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "amadeann.jack-language-syntax-highlighting"
vscode "asciidoctor.asciidoctor-vscode"
vscode "christian-kohler.path-intellisense"
vscode "CoenraadS.bracket-pair-colorizer-2"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "DotJoshJohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "dtsvet.vscode-wasm"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "eg2.vscode-npm-script"
vscode "emeraldwalk.RunOnSave"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "felixfbecker.php-intellisense"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "gamunu.vscode-yarn"
vscode "GitHub.github-vscode-theme"
vscode "golang.go"
vscode "gurumukhi.selected-lines-count"
vscode "IBM.output-colorizer"
vscode "jakebathman.mysql-syntax"
vscode "janisdd.vscode-edit-csv"
vscode "mhutchie.git-graph"
vscode "mohsen1.prettify-json"
vscode "mosapride.zenkaku"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.debugger-for-chrome"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "Orta.vscode-jest"
vscode "PKief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-microprofile"
vscode "redhat.vscode-quarkus"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.live-sass"
vscode "ritwickdey.LiveServer"
vscode "ryanolsonx.solarized"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tomoki1207.vscode-input-sequence"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-concourse"
vscode "vmware.vscode-manifest-yaml"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "Vue.volar"
vscode "wmaurer.change-case"
vscode "xdebug.php-debug"
